resources/public/cv/gmarin.tex
% Created 2024-05-11 Sat 14:48
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper,12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\pagenumbering{gobble}
\usepackage[defaultsans]{opensans}
\usepackage[T1]{fontenc}
\usepackage[big]{layaureo} %better A4 formating
\usepackage{titlesec} %custom \section
\usepackage{url,parskip} %packages for formating
\usepackage{multicol} % multiples columns
\usepackage{ragged2e} % for alignment
\usepackage{color}
\usepackage{graphicx}
\usepackage{svg}
\usepackage{hyperref}
\definecolor{linkcolour}{rgb}{0,0.2,0.6}
\hypersetup{colorlinks,breaklinks,urlcolor=linkcolour, linkcolor=linkcolour}
\titleformat{\section}{\LARGE\scshape\raggedright}{\thesection}{1em}{}
\titlespacing{\section}{0pt}{4pt}{4pt}
\setlength{\columnsep}{1cm} % space between columns
\titleformat{\subsection}{\large\scshape\raggedright}{\thesubsection}{1em}{}
\titlespacing{\subsection}{0pt}{1pt}{1pt}
\date{}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.6.15)}, 
 pdflang={English}}
\begin{document}


\section*{\textbf{Gabriel Marin}}
\label{sec:org4cf61d2}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
Email & \href{mailto:marin.gabriel@protonmail.com}{marin.gabriel@protonmail.com}\\[0pt]
Github & \href{https://github.com/gabri3lmarin}{github.com/gabri3lmarin}\\[0pt]
Site & \href{https://gabri3lmarin.github.io}{gabri3lmarin.github.io}\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
About & Hello, I'm a software engineer with a background in networking\\[0pt]
 & and programming, passionate about open source software,\\[0pt]
 & programming languages and cardistry.\\[0pt]
\end{tabular}
\end{center}



\subsection*{\textbf{Experience}}
\label{sec:org9044921}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
2022-Present & Software Engineer at Luxoft, Bucharest\\[0pt]
 & Maintained project building environment using CMake.\\[0pt]
 & Done socket programming using ZeroMQ library in C/C++.\\[0pt]
 & Automated environment configuration using Docker and Bash.\\[0pt]
 & Created integration tests using Golang and Clojure.\\[0pt]
 & Developed command line interface for sending/receiving messages.\\[0pt]
 & Developed certificate viewer in C++ using OpenSSL API\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
2021-2022 & Software Engineer at Continental, Sibiu\\[0pt]
 & Worked on code generator, parsing XML and Json with Java and Python.\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
2019-2021 & System Engineer at Ministry of Internal Affairs, Rm.Valcea\\[0pt]
 & Developed scripts for task automation with PowerShell.\\[0pt]
 & Deployed and configured Radius server and Squid proxy.\\[0pt]
2018-2019 & Middleware Engineer at Ministry of Internal Affairs, Bucharest\\[0pt]
 & Provided layer 1 support.\\[0pt]
 & Managed users access in Oracle SQL database.\\[0pt]
\end{tabular}
\end{center}

\subsection*{\textbf{Education}}
\label{sec:org5c68c32}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
2018-2020 & Master's in Telecommunications Engineering at\\[0pt]
 & Military Technical Academy, Bucharest\\[0pt]
2014-2018 & Bachelor's in Telecommunications Engineering at\\[0pt]
 & Military Technical Academy, Bucharest\\[0pt]
\end{tabular}
\end{center}
\subsection*{\textbf{Skills}}
\label{sec:orgce8cb99}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
Programming & C/C++, Go, Clojure, Scheme, Common Lisp, Bash,\\[0pt]
Languages & Python, Java, JavaScript, Rust, SQL, PowerShell,\\[0pt]
 & Perl, Elixir, Erlang\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
Tools & Linux, \emph{Emacs}, Coreutils, Vim, Git, CMake, Org, Tmux, Datomic\\[0pt]
 & \LaTeX{}, Docker, Make, ZeroMQ, Hugo, Leiningen, Babashka, Guix,\\[0pt]
 & HTML/CSS, Django, React, Maven, PlantUML, Terraform, RabbitMQ\\[0pt]
\end{tabular}
\end{center}
\begin{center}
\begin{tabular}{{p{3cm}|p{13cm}}}
Languages & Romanian, English, Italian\\[0pt]
\end{tabular}
\end{center}
\end{document}
